<script>
export default {
  data() {
    return { dataValueA: 1, dataValueB: 2 }
  },
  // props: ['msg'],
  props: {
    msg: {
      // при полной форме каждый реквизит может дополнительно определить следующие параметры.
      type: String, // проверка типа. Может быть string, Number, Boolean, Array, Object, Date, Function, Symbol
      default: 'Дефолтное значение пропса', // значение по умолчанию.
      required: true // определяет обязательное наличие даного реквизита.
    }
  },

  emits: ['event-name'],
  methods: {
    clickBtn() {
      this.$emit('event-name')
    }
  }
}
</script>

<template>
  <div>
    <button @click="clickBtn">Кликни чтобы сгенерировать событые (посморти в консоль)</button>
    <p>{{ msg }}</p>
    <Transition></Transition>
    <!-- Компонент для создания анимаций при переходе между двумя состояниями компонента. Он использует CSS-классы для определения, какие стили должны применяться в каждый момент времени во время анимации. Чтобы использовать Transition, необходимо определить пару CSS-классов для начала и конца анимации и привязать их к компоненту, используя свойства name и appear.-->

    <TransitionGroup></TransitionGroup>
    <!-- Компонент для создания анимации при добавлении или удалении элементов в списке. Он работает похоже на Transition, но применяется к списку компонентов. Каждый элемент списка должен иметь уникальный ключ, чтобы Vue мог отслеживать их добавление и удаление.-->

    <KeepAlive></KeepAlive>
    <!-- Компонент для кэширования состояния компонента при его динамической отрисовке. Когда компонент скрыт, его состояние сохраняется, и когда он отображается снова, используется сохраненное состояние. Это может существенно повысить производительность приложения.-->

    <!--❕<Teleport></Teleport>❕-->
    <!-- (аналог реактовского портала) Компонент для перемещения элементов в другие части DOM, когда компонент рендерится. Это позволяет отображать элементы в других частях страницы, вне исходной иерархии компонентов.-->

    <!--❕<Suspense></Suspense>❕-->
    <!-- Компонент для ожидания завершения асинхронных операций и отображения заглушки во время ожидания. Он используется для создания более плавного пользовательского интерфейса, когда приложение загружает данные или производит другие асинхронные операции.-->
  </div>
</template>

<style scoped></style>

<!--  ✅✅✅✅✅✅✅✅✅✅ Связь между компонентами ✅✅✅✅✅✅✅✅✅✅ 
    Props и emit: Один из наиболее распространенных способов связи между компонентами в Vue.js. Он основан на передаче данных из родительского компонента в дочерний через свойство (props), и на передаче событий от дочернего компонента к родительскому через функцию emit. Таким образом, родительский компонент может передавать данные дочернему компоненту через свойства, а дочерний компонент может отправлять обратно события через emit.
 -->
