<script>
// Жизненный цикл компонента ето набор етапов (создание, монтирование, обновление, размонтирование) через которые проходит каждый компонент.
export default {
  beforeCreate() {}, // вызывается перед созданием экземпляра компонента и инициализацией его свойств и данных.
  created() {}, // вызывается после создания экземпляра компонента и инициализации его свойств и данных, но до того, как он был добавлен в DOM без компиляции.
  beforeMount() {}, // вызывается перед тем, как компонент будет добавлен в DOM с шаблоном HTML.
  mounted() {}, // вызывается после того, как компонент был добавлен в DOM.
  beforeUpdate() {}, // вызывается перед тем, как компонент будет обновлен в DOM.
  updated() {}, // вызывается после того, как компонент был обновлен в DOM.
  beforeUnmount() {}, // вызывается перед тем, как компонент будет удален из DOM.
  unmounted() {}, // вызывается после того, как компонент был удален из DOM.
  errorCaptured() {}, // вызывается при возникновении ошибки в дочернем компоненте.
  renderTracked() {}, // вызывается после того, как компонент был отрендерен и слежение за зависимостями было установлено.
  renderTriggered() {}, // вызывается после того, как компонент был отрендерен и произошло изменение зависимостей.
  activated() {}, // вызывается при активации компонента (например, когда он становится видимым после скрытия).
  deactivated() {}, // вызывается при деактивации компонента (например, когда он становится скрытым после показа).
  serverPrefetch() {} // вызывается на сервере при предварительной загрузке компонента.

  // в композиционном API хуки такие же только с приставкой on но без хуков beforeCreate и created.
}
</script>

<template>
  <div></div>
</template>

<style scoped></style>
