<script setup>
import { useRoute, useRouter } from 'vue-router'
import { useStore } from 'vuex'
import HelloWorld from '../HelloWorld.vue'

const route = useRoute() // возвращает текущее располажение маршрута. Еквівалент использования $route.
const router = useRouter() // возвращает екземпляр маршрутизатора. Еквівалент использования $router.
const store = useStore() // что б получить доступ к глобальному (vuex) store

console.dir(route)
console.log(route.params)
console.dir(router)
console.log(store.state.count)

function getMutationsMethods() {
  return {
    // access a mutation
    increment: () => store.commit('increment'),

    // access an action
    asyncIncrement: () => store.dispatch('asyncIncrement')
  }
}
console.log(getMutationsMethods())

const props = defineProps(['filename', 'id'])
console.log(props)

// МЕТОДЫ на прототипе useRouter
// router.back() // переходит на предыдущий маршрут в истории браузера.
// router.currentRoute // текущий маршрут, представленный в виде реактивной ссылки (Reactive Reference).
// router.forward() // переходит на следующий маршрут в истории браузера.
// router.getRoutes() // возвращает массив объектов, представляющих все маршруты в роутере.
// router.go() // переходит на маршрут в истории браузера на delta позиций от текущего местоположения.
// router.hasRoute() // проверяет, существует ли маршрут с заданным именем.
// router.install() // устанавливает роутер как глобальную опцию в приложении Vue.
// router.isReady() // возвращает Promise, который будет разрешен, когда роутер будет готов к использованию.
// router.onError() // добавляет функцию, которая будет вызываться в случае ошибки при переходе на новый маршрут.
// router.push() // переходит на новый маршрут, используя метод pushState и добавляет новый маршрут в историю браузера.
// router.removeRoute() // удаляет маршрут с заданным именем из роутера.
// router.replace() // переходит на новый маршрут, используя метод replaceState и заменяет текущий маршрут в истории браузера на новый маршрут.
// router.resolve() // преобразует rawLocation в объект маршрута, используя текущий маршрут currentLocation в качестве контекста.

function goBack() {
  router.push({ name: 'newfile' })
}

// // Navigation Guards
// router.beforeEach() // ✅ Global Guards ✅ добавляет функцию, которая будет вызываться перед каждым переходом на новый маршрут. Он принимает три аргумента: to (маршрут, к которому мы переходим), from (маршрут, с которого мы переходим) и next (функция, которую нужно вызвать, чтобы продолжить навигацию).

// router.beforeResolve() // ✅ Global Guards ✅ Этот хук вызывается перед тем, как маршрут будет разрешен. Он позволяет выполнить дополнительные операции, которые могут потребоваться перед разрешением маршрута.

// router.beforeEnter() // ✅ Global Guards ✅ Этот хук вызывается перед разрешением маршрута и может быть использован для выполнения операций, которые нужно выполнить перед входом в определенный маршрут.

// router.afterEach() // ✅ Global Guards ✅ Этот хук вызывается после каждого навигационного перехода. Он может использоваться для выполнения операций, которые нужно выполнить после перехода.

// beforeRouteUpdate() // ✅ In-Component Guards ✅ Этот хук вызывается, когда параметры маршрута изменяются, но компонент, связанный с маршрутом, остается тем же самым. Он может быть использован для выполнения операций, которые нужно выполнить перед обновлением компонента.

// beforeRouteEnter() // ✅ In-Component Guards ✅ Этот хук вызывается перед тем, как компонент, связанный с маршрутом, будет создан. Он позволяет выполнить дополнительные операции, которые могут потребоваться перед созданием компонента.

// beforeRouteLeave() // ✅ In-Component Guards ✅ Этот хук вызывается перед тем, как компонент, связанный с маршрутом, будет уничтожен. Он позволяет выполнить дополнительные операции, которые могут потребоваться перед уничтожением компонента.
</script>

<template>
  <main>
    <HelloWorld msg="You did it in RouterFile!" />
    <div>newfile: {{ $route.params.filename }}!</div>
    <div>fileid: {{ $route.params.id }}!</div>
    <button @click="goBack">Go back</button>
  </main>
</template>

<!-- 
  LocationQuery - это интерфейс, который определяет формат строки запроса для маршрута.

LocationQueryRaw - это интерфейс, который определяет необработанный формат строки запроса для маршрута.

PathParserOptions - это интерфейс, который содержит опции для настройки парсера пути.

RouteComponent - это компонент Vue, который будет отображаться при сопоставлении маршрута.

RouteLocationRaw - это интерфейс, который определяет необработанный формат местоположения маршрута.

RouteParams - это объект, который содержит параметры маршрута.

RouteParamsRaw - это объект, который содержит необработанные параметры маршрута.

RouteRecord - это объект, который представляет собой запись маршрута.

RouteRecordName - это строка, которая идентифицирует именованный маршрут.

RouteRecordRaw - это объект, который содержит необработанные данные маршрута.

UseLinkOptions - это объект, который содержит опции для компонента router-link.
 -->
